In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
df = pd.DataFrame(columns=["Name", "Age", "Weight"])

In [5]:
df

Empty DataFrame
Columns: [Name, Age, Weight]
Index: []

In [6]:
df.loc[0] = ["Allen", 22, 75]

In [7]:
df

    Name  Age  Weight
0  Allen   22      75

In [8]:
df.loc[1] = ["Ted", 25, 80]

In [9]:
df

    Name  Age  Weight
0  Allen   22      75
1    Ted   25      80

In [10]:
df["Height"] = [175, 180]

In [11]:
df

    Name  Age  Weight  Height
0  Allen   22      75     175
1    Ted   25      80     180

In [12]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180

In [13]:
df

    Name  Age  Weight  Height
0  Allen   22      75     175
1    Ted   25      80     180

In [14]:
df = df.drop("Weight", axis=1)

In [15]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180

In [16]:
df.drop(1)

    Name  Age  Height
0  Allen   22     175

In [17]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180

In [18]:
df = df.drop(1)
df

    Name  Age  Height
0  Allen   22     175

In [19]:
df.loc[0] = "123"

In [20]:
df

  Name  Age Height
0  123  123    123

In [21]:
columns = ["Name", "Age", "Weight"]
data = [
    ["Allen", 22, 75],
    ["Ted", 25, 80],
]

df = pd.DataFrame(data=data, columns=columns)

df

    Name  Age  Weight
0  Allen   22      75
1    Ted   25      80

In [22]:
columns = ["Name", "Age", "Weight"]
data = [
    ["Jake", 28, 75],
    ["Mary", 29, 80],
]

df2 = pd.DataFrame(data=data, columns=columns)

df2

   Name  Age  Weight
0  Jake   28      75
1  Mary   29      80

In [25]:
pd.concat([df, df2]).reset_index(drop=True)

    Name  Age  Weight
0  Allen   22      75
1    Ted   25      80
2   Jake   28      75
3   Mary   29      80

In [26]:
df3 = pd.concat([df, df2]).reset_index(drop=True)
df3

    Name  Age  Weight
0  Allen   22      75
1    Ted   25      80
2   Jake   28      75
3   Mary   29      80

In [27]:
df3["Weight"]

0    75
1    80
2    75
3    80
Name: Weight, dtype: int64